<a href="https://colab.research.google.com/github/marisbotero/2d-Game-Unity/blob/master/workshop.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## ðŸ¦„Workshop Intro

In [0]:
import pandas as pd
import numpy as np

In [0]:
df = pd.read_csv('train.csv')

In [0]:
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [0]:
df.head(2)

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C

[2 rows x 12 columns]

In [0]:
df.tail(2)

     PassengerId  Survived  Pclass  ...   Fare Cabin  Embarked
889          890         1       1  ...  30.00  C148         C
890          891         0       3  ...   7.75   NaN         Q

[2 rows x 12 columns]

In [0]:
df.shape

(891, 12)

In [0]:
df.info

<bound method DataFrame.info of      PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]>

In [0]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [0]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [0]:
df.describe()

       PassengerId    Survived      Pclass  ...       SibSp       Parch        Fare
count   891.000000  891.000000  891.000000  ...  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642  ...    0.523008    0.381594   32.204208
std     257.353842    0.486592    0.836071  ...    1.102743    0.806057   49.693429
min       1.000000    0.000000    1.000000  ...    0.000000    0.000000    0.000000
25%     223.500000    0.000000    2.000000  ...    0.000000    0.000000    7.910400
50%     446.000000    0.000000    3.000000  ...    0.000000    0.000000   14.454200
75%     668.500000    1.000000    3.000000  ...    1.000000    0.000000   31.000000
max     891.000000    1.000000    3.000000  ...    8.000000    6.000000  512.329200

[8 rows x 7 columns]

In [0]:
df.describe(include = ['O'])

                       Name   Sex Ticket    Cabin Embarked
count                   891   891    891      204      889
unique                  891     2    681      147        3
top     Partner, Mr. Austen  male   1601  B96 B98        S
freq                      1   577      7        4      644

In [0]:
df.nunique()

PassengerId    891
Survived         2
Pclass           3
Name           891
Sex              2
Age             88
SibSp            7
Parch            7
Ticket         681
Fare           248
Cabin          147
Embarked         3
dtype: int64

In [0]:
df.nunique(dropna=False)

PassengerId    891
Survived         2
Pclass           3
Name           891
Sex              2
Age             89
SibSp            7
Parch            7
Ticket         681
Fare           248
Cabin          148
Embarked         4
dtype: int64

In [0]:
df.count()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

In [0]:
df['Embarked'].mode()

0    S
dtype: object

In [0]:
df['Embarked'].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [0]:
df['Embarked'].value_counts(dropna=False)

S      644
C      168
Q       77
NaN      2
Name: Embarked, dtype: int64

In [0]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [0]:
#Â¿Cuantos Hombres y Mujeres tenemos en nuestro dataset?
df.groupby('Sex').size()

Sex
female    314
male      577
dtype: int64

In [0]:
#df.groupby('Age').size()

In [0]:
#Â¿Cual es la edad mas frecuente en nuestro conjunto de datos?
df['Age'].mode()

0    24.0
dtype: float64

In [0]:
#Â¿Cual es la edad mas frecuente en los hombres?
df[df.Sex== 'male'][['Age']].mode()

    Age
0  19.0
1  25.0
2  28.0

In [0]:
#Â¿Cual es la edad mas frecuente en mujeres?
df[df.Sex== 'female'][['Age']].mode()

    Age
0  24.0

In [0]:
#Â¿Cual es el precio del tiquete mas comÃºn?
df['Fare'].mode()

0    8.05
dtype: float64

In [0]:
#Â¿El precio del tiquete mÃ¡s comÃºn es el mismo para mujeres?
df[df.Sex =='female'][['Fare']].mode()

   Fare
0  7.75

In [0]:
#Â¿El precio del tiquete mÃ¡s comÃºn es el mismo para hombres ?
df[df.Sex =='male'][['Fare']].mode()

   Fare
0  8.05

In [0]:
# Eliminar columnas PassengerId, Name, Cabin, la columna ticket no la vamos a eliminar todavia.
df.drop(['PassengerId','Name','Cabin'],axis=1, inplace=True)
df.shape

(891, 9)

### Limpieza de datos

In [0]:
df.isnull().sum()

Survived      0
Pclass        0
Sex           0
Age         177
SibSp         0
Parch         0
Ticket        0
Fare          0
Embarked      2
dtype: int64

In [0]:
# Para eliminarlos usamos
df.dropna(inplace=True)
df.shape

(712, 9)

In [0]:
titanic = pd.read_csv("train.csv")
titanic.drop(['PassengerId','Name','Cabin'],axis=1, inplace=True)
titanic.fillna(-1).head(10)

   Survived  Pclass     Sex   Age  ...  Parch            Ticket     Fare  Embarked
0         0       3    male  22.0  ...      0         A/5 21171   7.2500         S
1         1       1  female  38.0  ...      0          PC 17599  71.2833         C
2         1       3  female  26.0  ...      0  STON/O2. 3101282   7.9250         S
3         1       1  female  35.0  ...      0            113803  53.1000         S
4         0       3    male  35.0  ...      0            373450   8.0500         S
5         0       3    male  -1.0  ...      0            330877   8.4583         Q
6         0       1    male  54.0  ...      0             17463  51.8625         S
7         0       3    male   2.0  ...      1            349909  21.0750         S
8         1       3  female  27.0  ...      2            347742  11.1333         S
9         1       2  female  14.0  ...      0            237736  30.0708         C

[10 rows x 9 columns]

In [0]:

titanic['Age'].fillna(titanic['Age'].mean()).head(10)

0    22.000000
1    38.000000
2    26.000000
3    35.000000
4    35.000000
5    29.699118
6    54.000000
7     2.000000
8    27.000000
9    14.000000
Name: Age, dtype: float64

In [0]:
titanic['Age'].fillna(titanic['Age'].median()).head(10)

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5    28.0
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [0]:
titanic['Age'].fillna(titanic['Age'].mode()[0]).head(10)

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5    24.0
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [0]:
titanic['Age'].fillna(method='backfill').head(10)

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5    54.0
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [0]:
titanic['Age'].fillna(method='ffill').head(10)

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5    35.0
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [0]:
# Para eliminarlos usamos
df.dropna(inplace=True)
df.shape

(712, 9)

In [0]:
# Cambiar nombre de columnas a minusculas
df.rename(columns = lambda col: col.lower(),inplace=True)

In [0]:
# Validar dataset
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 712 entries, 0 to 890
Data columns (total 9 columns):
survived    712 non-null int64
pclass      712 non-null int64
sex         712 non-null object
age         712 non-null float64
sibsp       712 non-null int64
parch       712 non-null int64
ticket      712 non-null object
fare        712 non-null float64
embarked    712 non-null object
dtypes: float64(2), int64(4), object(3)
memory usage: 55.6+ KB

In [0]:
# Luego de eliminar los nulos, se debe de resetear los indices, como puedes ver aparecen de 0 a 890 todavia 
# a persar de que tenemos 712 filas.
df.reset_index(drop=True,inplace=True)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 712 entries, 0 to 711
Data columns (total 9 columns):
survived    712 non-null int64
pclass      712 non-null int64
sex         712 non-null object
age         712 non-null float64
sibsp       712 non-null int64
parch       712 non-null int64
ticket      712 non-null object
fare        712 non-null float64
embarked    712 non-null object
dtypes: float64(2), int64(4), object(3)
memory usage: 50.2+ KB

In [0]:
# Validar los tickets duplicados
df_tickets = df.groupby('ticket').size().reset_index().rename(columns={0:'count'})
df_tickets.head()

   ticket  count
0  110152      3
1  110413      3
2  110465      1
3  110564      1
4  110813      1

In [0]:
# Ordenar los cantidad de registros por tickets
df_tickets.sort_values(by=["count"],ascending=False,inplace=True)
df_tickets.head()

           ticket  count
273        347082      7
207       3101295      6
277        347088      6
445       CA 2144      6
490  S.O.C. 14879      5

In [0]:
# Validemos un tiquete
df[df['ticket']=='347082']

     survived  pclass     sex   age  sibsp  parch  ticket    fare embarked
12          0       3    male  39.0      1      5  347082  31.275        S
93          0       3  female   2.0      4      2  347082  31.275        S
428         0       3  female   9.0      4      2  347082  31.275        S
429         0       3  female  11.0      4      2  347082  31.275        S
481         0       3  female  39.0      1      5  347082  31.275        S
649         0       3  female   6.0      4      2  347082  31.275        S
676         0       3    male   4.0      4      2  347082  31.275        S

In [0]:
# Primero adicionaremos la columna 'count' de df_tickets a nuestro dataset titanic
titanic = df.merge(df_tickets,left_on='ticket',right_on='ticket',how='left')
titanic.shape

(712, 10)

In [0]:
titanic['family'] = [1 if count>1 else 0 for count in titanic['count']]
titanic.head()

   survived  pclass     sex   age  ...     fare  embarked count  family
0         0       3    male  22.0  ...   7.2500         S     1       0
1         1       1  female  38.0  ...  71.2833         C     1       0
2         1       3  female  26.0  ...   7.9250         S     1       0
3         1       1  female  35.0  ...  53.1000         S     2       1
4         0       3    male  35.0  ...   8.0500         S     1       0

[5 rows x 11 columns]

In [0]:
# Recuerdan las funciones? vamos a crear una funcion que nos servira para limpiar texto, en este caso el campo tickets
def limpiar_caracteres(cadena):
    import re
    patron = '[^A-Za-z0-9]+'
    return re.sub(patron, '', cadena)

In [0]:
titanic['ticket'] = titanic['ticket'].apply(limpiar_caracteres)
titanic.head()

   survived  pclass     sex   age  ...         ticket     fare embarked  count
0         0       3    male  22.0  ...        A521171   7.2500        S      1
1         1       1  female  38.0  ...        PC17599  71.2833        C      1
2         1       3  female  26.0  ...  STONO23101282   7.9250        S      1
3         1       1  female  35.0  ...         113803  53.1000        S      2
4         0       3    male  35.0  ...         373450   8.0500        S      1

[5 rows x 10 columns]

In [0]:
# Para continuar eliminaremos la columna ticket
titanic.drop('ticket',axis=1,inplace=True)
titanic.head()

   survived  pclass     sex   age  sibsp  parch     fare embarked  count
0         0       3    male  22.0      1      0   7.2500        S      1
1         1       1  female  38.0      1      0  71.2833        C      1
2         1       3  female  26.0      0      0   7.9250        S      1
3         1       1  female  35.0      1      0  53.1000        S      2
4         0       3    male  35.0      0      0   8.0500        S      1

## Codificando variables categoricas

In [0]:
titanic['sexDummies'] = titanic['sex']
titanic = pd.get_dummies(titanic, columns = ['sexDummies'], prefix = ['D'])
titanic.head()

   survived  pclass     sex   age  ...  embarked  count  D_female D_male
0         0       3    male  22.0  ...         S      1         0      1
1         1       1  female  38.0  ...         C      1         1      0
2         1       3  female  26.0  ...         S      1         1      0
3         1       1  female  35.0  ...         S      2         1      0
4         0       3    male  35.0  ...         S      1         0      1

[5 rows x 11 columns]


## Practica

- Agrupar el conjunto de datos por genero ('sex') y calcular el promedio de la edad ('age').
- Agrupar el conjunto de datos por la columna familia ('family') y contar la cantidad de registros por grupo.
- De las familias cuantos se sobrevivieron y cuantos no.

In [0]:
titanic = df
print(df["survived"][df["sex"]=='male'].value_counts(normalize = True))
print("-----------")
print(df["survived"][df["sex"]=='female'].value_counts(normalize = True))

0    0.794702
1    0.205298
Name: survived, dtype: float64
-----------
1    0.752896
0    0.247104
Name: survived, dtype: float64

In [0]:
df.head()

   survived  pclass     sex   age  ...  parch            ticket     fare  embarked
0         0       3    male  22.0  ...      0         A/5 21171   7.2500         S
1         1       1  female  38.0  ...      0          PC 17599  71.2833         C
2         1       3  female  26.0  ...      0  STON/O2. 3101282   7.9250         S
3         1       1  female  35.0  ...      0            113803  53.1000         S
4         0       3    male  35.0  ...      0            373450   8.0500         S

[5 rows x 9 columns]

In [0]:
df.groupby(['sex']).mean()

        survived    pclass        age     sibsp     parch       fare
sex
female  0.752896  2.073359  27.745174  0.644788  0.714286  47.332433
male    0.205298  2.335541  30.726645  0.439294  0.271523  27.268836

In [0]:
df.groupby(['sex']).mean()

        survived    pclass        age     sibsp     parch       fare
sex
female  0.752896  2.073359  27.745174  0.644788  0.714286  47.332433
male    0.205298  2.335541  30.726645  0.439294  0.271523  27.268836